let count = 0;
let corruptedText = [
    ['S̶̪̙͙̬̈́́p̶̩̟̿̔a̵͇̔č̸̬͠ ̵̲̾ͅr̵̦̽š̴̨e̶̡͔͉͉̅̄̑̅ ̶̡̦͓͚͂̆͆Ċ̷̥̗͠ȯ̶̥̯̐d̵͇͝ē̶̻̯͍̙', 'S̵̢͈̽p̴̩̭͋̈́͛a̶͕̳͐̏c̵͖̮͠ȍ̸̙̃d̴͙̙͖͊̅ḛ̷̝̃̃͑͜', 'S̵̛̻͙͑͊́͘̚͠ͅp̵̨̢̡̤͉̝̲̤͎͈͉̭̱̟͖͔̙͖̽̏ͅa̵̯̪̗̜͂̓͂̏͌̐̀̒̊̈͂͋̀̌͗̀̋ȑ̶̢͕̮̤͕̘̳̙̝̝̤̗̳̻̟̖̹̎̌̈́̑̾̌̃̌͊͒̓͒̓̑́͠͝͝ͅs̷̢̡̧͙̟̙̘̲͖̜͍̘̝͚̞͐̃͜ͅę̴̛͇̟̝̦͈̎̅͒̀̇̆̽̈̃́̉̚ ̶̧̱͚̝͔͇̰͍͙̖͚͎̗̃̊̿͊͑̐͆͋̍̎͆C̸͉̣̳̲͈̦̳̥̬̝̦̣̈́́̂̿͛̎̓̈̏͋͆͒̈͋̚͜͝͝ơ̴̢̛̠͍̗͈̭͓̫̹͈̝̫̟̬̾͂́͒̊͊́̀͌̍̕͠͠͝ḑ̸̡̪̣̞̖͛̂̔̾̉̊̉̈̔͆̚ę̶̰̝̠̹̀̕'],
    ['B̶͎̙̗̣͝o̸̡͙̒̒͒a̴̧͍̻̥̕ȓ̶̫̦̹͚̿͠d̸͓̀̌ ̷̪̂̽̕͝G̷̼̖͑e̴̻͍͠ ̵̨̦̺͆̒Ṫ̶̝̭r̶̹̠̾̕a̴̢͔͍̺̍̊̄v̸̰͚͖̈́̎̈́e̴̺̞̎ĺ̴̝͘', 'Ḃ̷̥o̷͈̕r̵̜̔a̷̱͑d̵̘̃ ̸̹̂T̸̜̄r̷͈͐ȃ̵̮v̵͉͛e̶͈̕ĺ̸͇','B̶̬̙̯̝̲̱̝̙̘͖͈̓́͜͜ơ̶̞͎̘͔̝͈̹̘̈̂͊̀̐̀͐̈̄͆͌͗͘͜͝a̴̢̱̖̪̭̼͕͍͎̯͎͍̰͔͙͈̰̔̇̈͋͗̍̀̍̈́̔̒́͒̀͗͛͛̓͜r̷̨̼̗͈̺̥̬̜͛d̸̨̢̺̼̳̬̥̯̪̩̺̯̩̙̟͋̋͌͛̔͌̀̿̆̋͐̕̕͜ͅ-̷͉̣̳͔͓͖̺̈́̽͌̀̀̓́͘T̷̨͕̗̤̥̹̹͈̩̖̦̝̱͍̜͈̩̜̩́͂̀͛̆̉͗̀̾͠r̵̼͈̞̈́̄͑̃̄̾̄̾̈́̋̐͒̄̒̈́̈͝a̶̪̣̦͍̺͖͑̆̈͆̅v̵̯̜̮̻̮̩́͌̾͋̊́́̑̚̚͜e̶̺͍͂̀͆̾̈́͒̒̅͗̋̅̒̈́̕͝ļ̴̪̞̰̩̿̊̊̀̃͐̀̒̈́́̈́̌̈͝'], 
    ['M̵̡̪̒ö̵͍̲̻̫́͂r̸̲̰͓͙͝S̴̮̤̀̓̉͛p̸̹̫̥̕â̷̠̹̗͍̕c̵̢̹̭̝͆̔̀̚', 'M̶̥̃o̵̹̐r̸̦͗S̸͓͠p̷̙̒a̶̢̍c̸͙͒', 'M̷̛̯͛̋ŏ̸̬̼̤̮͓̭̖̥̭͍͈̱̲̭̥̹͙̙̪̂͗͋̆̊̀̇̓̓͝͝ř̴̛̖̻̬̗̬̙̟̪̮͕̺͉̺̼͔̥̂̑͌̂̚͘-S̵̢̧̲̮̫̥̘̻̣̆̓̅͂̾̐̈́̋̒͊̈́̂̀̔̈́̕̕͘p̴̪͌͗͆͆̆ā̷̡̳̖̻̙̟͉̠̱̼̟͙̼̫͚͆̌̐̒̾̏̆̏̓͜ċ̵̨̢̧̣͖̳͙͈͚̮̜̫̙̙̓̈́͒̐̽̉̽̒͘͜͠͝͠͝ͅ'], 
    ['R̴͕̙̦̆͝ȏ̷̫͙̑l̸̦̰̝̫̇̚i̶̫̮͑n̵̡̢͙̞̾̈́g̵̰̉͆̇̌-̷̦̀̇̐͑P̴̛̬͋͐̂͜l̸̫͌͝ǎ̶̡̯̰̯̌y̵̤̎̊͝Ö̴̡̮͓̞́ǘ̵͖̟̥̂̏͝ţ̸̼͐̄̆', 'R̸͕̃ō̶̲l̶̬̓í̶͚n̵̗̉g̷͎̏-̵͉̇P̶̬̀l̶͙͝â̴̠y̷̪͐ó̶͇u̵̢̓ẗ̷͚́', 'Ŗ̵̡̭͙̗͕͇͍͚̼̥͊̐̏̄̋̇̾̆͛̾̿͒̊̐̈́̕o̶͎͛̆̾̒̆̀̈͑͛̈́͑̃͌̏̿̈́͠͝ļ̷̢̩͎͎͓͍̥̟̻̥͔͖̳͊̇̓̇̆͜i̷̢͚̳͕͕̭̟̣͌̃͂̿́̈́̇̄̀͘̚͘ṋ̴̮̥̘̣̎͒͗̽͜ͅg̸̡̛̜̤̱̙̹̦̯̝̦̜̐͗͋̈́͗͘ͅ ̶͓̥̈́̐͋P̷̣̫̭̩͖̳̯̈́͌̿͆̀̏̓́͆̉̋́̍̔̌͌ļ̴̞̥̰͈̱͈͖͒̊̂̍̃̉̏̿̔͂̀͊̽̓̎͠ͅa̴̳͉̤̔̓̾́̍͂͆́̚͜y̴̡̢̧̩̖̝͎͙̼͖͓̏̊͂̔̿̅̀͂̊̑͛̂̿͝ợ̸̡̫̞̰̱̬͙͎̝̜͖͚͙̦̠̤̾̈́̂̐͐̒̉̍͋́̑̍̋́͘͜͝ṻ̸̢͙͕̹͈̖̇͛̌̃̀̌̊̚ț̸̭͉̰̮̳̣͚̥̑̈̽̂̔͗͂̎̿̔͑̾͒̂̆̎͊̚͜͠'],
    ['v̴̛͕̈́ị̷̎͑T̸̳͆͋r̸͕̜͋i̶̼͖̺̊͆̈͊ą̸̼̣̟̿', 'v̸͙̽i̶͔͑ȧ̶̝Ț̸͊r̷̡̎ĩ̴̩', 'v̶̱̫̟̖̩͓͆̆͜͝͝ȋ̷͓̗̫̓̆̐̈́͑̎͂̇̕͠r̶̨̛̘̞̺̺̜͉̮̰͙͈͉̤͎͖͋̿̅̊̒̍̓́̊͛͐̽̚͜͠͝ͅi̴̡̡̨̡̨̢̞̳̼̭̬̹̖̥͚̓̄̋̈͋̏̿̉́̅͠͠ͅŢ̶̨̺͙̩̝̮͚̭̬̝̻̯̗̤͔̊̈͊͑̌̄̀̋̄̎̾͂̓̽̂͜r̷̡̠̩͎̞̮̘̤͖͔̺̠̤̳̹̫̹̜̈̒̿̀̌̈́̒̃͘͜͝͠i̷̡̧̤̳͎͉͖͈͍̘̯̖͚̜̱̭̾́̃̓̎̂̉̈́̚͝͠a̴̲̳̱̺̜̜̞͔̯̔̈̈́̄̀̎͌́̆͛͜͠'],
    ['T̷̈́̆͜ī̶̩ͅm̸̧̟̯̄̓̆͌͜ ̴̭͚͙͇̀͋̒͠G̷̡̹̤͂ä̶͈̦́m̸̛̤', 'T̵͔͋i̸̢͂m̶̢̒G̴͙̉a̵͉̕m̴͓̾', 'T̶̨̛̼̜̗̝͖͔̖̝̯͈̀͆̄̓̂́̈́̐̃̓̋̊̈́̐͒͘͜͠ḯ̷̢̲͛͋̋̏̓̉̈́͋̚̚͝͝͝͠͠m̶̢̢̛̟̼̼̖̟͍͇̼̩͙̮̬͕̦̀̓͐̀͒̌̇̑̽͑̃͒̎̓̊̾-̷̨͔̜̥͇̯̜̠̩̝͖̫̗̙͇͎̫̪̈͛̽̔̔̒̆̾̄͆̓̈̒͛̈͐̈́͐̚ͅG̵̢̡̲͇͍̘̦̼̳̜̒̀ä̶̭̳̊͒̿̂̀͛̾̀̋̈́̄̓̚m̶̥̽̅̆̄͌̃̔̎̕͝͝'],
    ['H̸̱͓̤͔͎͌̏ȃ̴̛̖̮̰̦͕͙͍̘̈̑̎́͑ͅm̵̢̧͉͈̲̙͛̃̚p̵̨̼͓̟̜̝͙̥̈́̈͊̐̾̑̂̕t̴͈̭̩̒ė̵̢̛̳̖͍͓͇͖̝ͅr̴̮̘̤̱͆̿̇̅̒̑ ̴̧̟͖̙͎̻͛̇́͆z̴͍̩̪͚͖̜̖͊͌̒̒̋͝u̴̻̽͊̍̌͊͗P̴̧͖̤̞͉͓̲̤̮̱̈́̏̇̕͜z̸̧̡̛̞̪̹͕̩̲̥̙̥̞͕͔̓̎͒̄̄̋̋̊͊̍l̵̨̡͍̬͓̻̂e̶̡̤̯͈̭̠̻̮͈̩̎̂̈́̎,', 'H̴͚̋â̴͕m̸̻̀p̸̘͌t̵͈̋e̴̳̾r̸̖̐ ̵͙͒z̸̢̍ǔ̷̗P̵̬̉z̸̟̎l̷̓ͅẻ̴̺', 'H̴̢̧̝̞̳͓̪͓̤̒̈́͑̽̈́̊̅̔̓̕͝͝a̷̛͇̗̻͋͗̂̌̈́̈́̆̏̎̉͗̈́͒̕͜͝ͅm̴̛̦͇̯̻̓̂̅̈́̑̄͐̄͐̈́̆̕͝͝͝ͅp̷̪̣̙̹͑̅̓̔̈́̌̄͛̅́̕ͅt̸̨̗̜͕̺̥̮̠̦̤̏̈́͒̀̐̿̎̀̎̈͆̅͂̆̾͠͝͝ȩ̶̧͖͎̭̮̰̻̪̑̾͗̅̓̃͂̃͌̐̏̓͌͛͐͘͜r̸̡̧̛̝̣̻̘̰̦̪̬̮̐̓͗̾̽͆͑͌͑́͛̊̓ ̴̢̘̟̺͕̼̟͇̭̪̼͔̃̈́̓̉̈́́͐̄́͑̇̆́̕̚͜͜͠͝͠ͅẕ̸̨̛̗̰͚̦̊͂͐͊͋͋̋̇̅͜͠͝ų̶̬̯̟̰̼̞̦͚̰̳̇̎P̶̧̧̛̰͍͍̺̹̥͎͓̺͈͈̝̠̃̀̔̐̽͑͐̌̊͘z̵̨͎͉͕͍̺̬̈́͋͛̇͊͋̈͌̇̈́̆̉̕͘l̴̥͔͍̥͇̯̙͕̣̯̀̃͌̔͛e̴̡̢͈͕͇̞̬͚̪̮͖̥͍͓̟͛̓͊̉͛͑̅̎̅̂͝ͅ'],
    ['k̵̰̜̟̻̑i̷̜̘͇̗͌͝͠ṇ̶̼͌ğ̶̰͍l̷̹͌ä̴̛͍̣̜́͋͜y̵͉͚̙̓̈i̸̘͔̜̙̎͌̉̚n̶̨͈̹̈́̓̽̉g̵̢̛̙̬͍̿̀', 'k̵̝͆i̴̱̓n̴̜͝G̴̡̿l̷̳̈́a̸̹͑y̶̲͋i̵̦̇n̸̤̓g̸̝̀','k̵̼͍͎̖͕̣̣̙̔̀̐̾̆̀̑̎̈́̈̈́̊̕͜į̶̨̨̮̥̗̳̠̳̬̺͙̈́͛̓͜͜͜͜ṋ̷̢̛̩̥͆͋̎̓̊̀̐̃͋̆̑̾̇̽͌̓̊̽g̴̢̥͇͔͈̥͔͎̼̿͛̿́̂̃̾̊̋̍̌͊̀͛̌̚̚͠͝s̶̡̧͉͕̙̣̪̦̺̜̝͉̼̫̝̗̀̊͛̈͌̊̾͑̅͗͘l̶̛̝͂́̂͒̃̍̎͂̍͊̑̋͠Ą̸͎̗̰͋͝ͅy̶̢̢̜͊̇i̸̢̡̡̛̛͈̝̗̣̯̪͙̜̮͈͙̾͑̃͊̓̄̈́̎̆͊̐͌͐̏͘͝͠ň̶̢̡̢̛̬̞͍͚͈̱͕͚͎̲̹̫̔͛́̾̑̿͌̀̓̊́̈́̀͗̕̚g̵͖̬̖͐̃̆͑̌̊̔̕'], 
    ['2̶̨̛̬̦̟̩̱͚̝͈͚͌́̀̈̿̌͐̒̄͋̕̚͝Ḋ̷̨̨̧̢̼͍̥̪̯̬̩̖̍̎̔̋͑̿̕̕ ̷̠͉͕̼̠̀̓̋̀̎̔̎̎̋͌͌H̴̰̼̬̩͒a̸̘͖̳̦͓͈̻͖͒̉͗̍̌́̃͛̔͑̈́ͅm̶͚̻̼̳͐̋̅̍̒͑̈̀̌̔̕͝', '2̵͕͗D̷̩̕ ̷̜̈́H̷̍ͅa̸̱͐m̶̺͒', '2̷̖̱͎̪̮̭̗̑̈́̒͆́̅̈́̇͆͝D̸̛̮̝̪̠̗͖͇̫͎͖̘̬̣̝̭̼̽̈́́͝͝ ̵̢̧͕̭͔͈̺̣̘̹̹͎͇̪̘͋̐̎̇̉͆̌͌̅̓̈́̑̀͒͌̐́͝Ḩ̵̳̮̤͉͖̺̥̺͍͚̦͚̾̿̾̑a̶̡̞̣͎̳͊̍͌̐̋ṃ̴̦͓̮̱̖̙̝̫͎͔̬̳̰̦̏̾̀ͅ']];
let indecisiveness = ['Are you really sure?', 'Are you really, positively sure?', 'You don\'t seem that sure...', 'You are really indecisive aren\'t you?'];

async function changeText(){
    let index = Math.floor(Math.random() * corruptedText.length);
    radios = document.querySelectorAll('label');
    radios[index].innerHTML = corruptedText[index][Math.floor(Math.random() * 3)];
    setTimeout(function() {
        changeText();
    }, 50)
}

function showPopup(){
    if (document.querySelectorAll('input[type="radio"]:checked').length) {
        document.getElementById("confirm").style.visibility = 'visible';
    }
}

function hidePopup(){
    document.getElementById("confirm").style.visibility = 'hidden';
    document.getElementById("sure").innerHTML = indecisiveness[count];
    count++;

    if(count>=5){
        document.getElementById("console").style.visibility = 'visible';
        script = ['???: Argh, every game jam these choices become more and more difficult to pick from.../???: I mean, it\'s as if the themes are specifically for me! /???: I wish I could choose all of them./???: That would make for an interesting game./$???: Uh oh... What\'s going on?/ $'];
        start();
    }
}

function startGlitching(){
    document.getElementsByTagName("p")[0].innerHTML = "W̶̩̤͑̒͆̀h̸̳̆͆i̷̢̪̻̫̒̃̋̃c̷̟͇̹̦̍̂͠ḫ̵̢́͆ ̷̟̓͜t̵̢͔̖̅͊h̴̢͖͎̼̿̇̓e̵̺̠͎̽m̴̨̭̾̇̚è̴̮͍̀́̆ ̸̧̠̻̩͗ḑ̶̜͈̟̊͒̐̿o̶̻̔ ̶͔̽̀̑ý̴̢͖̚͝ö̶̰̪́̈́͆̋u̶̧̩̟͚̍̎ ̶̛̭͇͒̌l̶̝͓͕̓̈̋ȋ̷̙͋̽k̶̢͕͔̓ę̸̻̂̋̂ͅ ̴̢̳̣̥̆̚t̵͂͜͠h̷͕̓̀̿͜e̶̠̍ ̶̨̣̟͑̉ͅm̸̛̛̼͔̙̚o̷̯̙̒s̶̛͇͖͂̽ţ̶͇̄̀̀̑?̵̠͝͠";
    let radios = document.querySelectorAll('label');
    let i = 0;
    radios.forEach(element => {
        element.innerHTML = corruptedText[i][0];
        i++;
    });
    changeText();
    radios = document.querySelectorAll('input[type="radio"]');
    radios.forEach(element => {
        element.checked = true;
    });
    showText(remainingText.slice(1));
}